#ifndef LETTERFREQUENCY_H
#define LETTERFREQUENCY_H

//定义了储存字母与其频率的结构
struct LetterFrequency {
    char letter;    //字母
    double freq;    //频率
};

LetterFrequency Data[] = {
   {'A', 0.0819}, {'B', 0.0147}, {'C', 0.0383}, {'D', 0.0391}, {'E', 0.1225},
   {'F', 0.0226}, {'G', 0.0171}, {'H', 0.0457}, {'I', 0.0710}, {'J', 0.0041},
   {'K', 0.0014}, {'L', 0.0377}, {'M', 0.0334}, {'N', 0.0706}, {'O', 0.0726},
   {'P', 0.0289}, {'Q', 0.0009}, {'R', 0.0685}, {'S', 0.0636}, {'T', 0.0941},
   {'U', 0.0258}, {'V', 0.0109}, {'W', 0.0159}, {'X', 0.0021}, {'Y', 0.0158},
   {'Z', 0.0008}
};

#endif // LETTERFREQUENCY_H
